<a href="https://colab.research.google.com/github/antonioscript/MySQL/blob/main/MySQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Comandos Básicos MySQL

###1 - SELECT (Consultas)

In [ ]:
#Nome do banco : banco
#Nome das tabelas: clientes, pedidos, categorias, locais, etc
- Exemplo1. Selecionando todas as linhas e colunas da tabela pedidos
SELECT * FROM clientes;

-- Exemplo2. Selecionando colunas específicas da tabela clientes
SELECT ID_Cliente, Nome, Email FROM clientes;

-- Exemplo3 . Selecionar apenas as 5 primeiras linhas da tabela produtos
SELECT * FROM produtos
LIMIT 5;

-- Exemplo4. Dando Nomes Diferentes para o nome da coluna
SELECT
	ID_Cliente AS 'ID Cliente', 
    Nome AS 'Nome do Cliente', 
    Data_Nascimento AS 'Data de Nascimento',
    Email AS 'Email do Cliente',
FROM clientes

-- Exemplo5. Ordenando a Tabela (ORDER BY)
SELECT * FROM produtos
ORDER BY Preco_Unit ASC; #OU DESC

###2 - WHERE

In [ ]:
-- Exemplo1. Mostrar os produtos com preços iguais ou maiores que R$ 1.800
SELECT * FROM produtos
WHERE Preco_Unit >= 1800;

-- Exemplo 2. Produtos da Marca DELL
SELECT * FROM produtos
WHERE Marca_produto = 'DELL';

###3 - And e OR

In [ ]:
-- Exemplo1. Mostrar Clientes SOlteiros e  do Sexo Masculino
SELECT * FROM clientes
WHERE Estado_Civil = 'c' AND Sexo = 'M';

-- Exemplo2. Mostrar Clientes Não Solteiros
SELECT * FROM clientes
WHERE NOT Estado_Civil = 'S'

###4 - Funções de Agregação 
- Count 
- Count(*) 
-Count(Distinc) 
-Sum
-AVG
-MIN
-MAX

In [ ]:
-- 1.COUNT(Nome Coluna) -> Quantidade de linhas da coluna 'Nome'
SELECT 
	COUNT(nome)
FROM clientes;

-- 2. Quantidade de Linhas da Tabela
SELECT 
	COUNT(nome)
FROM clientes;

-- 2. Descobrindo a quantidade de Escolaridades DISTINCT 
SELECT 
	COUNT(DISTINCT Escolaridade)
FROM clientes;

-- 2. SUM, AVG, MIN, MAX
SELECT
	SUM(Receita_Venda) AS 'Soma da Receita',
    AVG(Receita_Venda) AS 'Média da Receita', 
    MIN(Receita_Venda) AS 'Menor Valor da Receita',
    Max(Receita_Venda) AS 'Maior valor da Receita'
FROM pedidos;

###5 - Groupby

In [ ]:
-- 1 - Quantidade de Clientes por Sexo
SELECT 
	Sexo,
    COUNT(*) AS 'QTD Clientes'
FROM clientes
GROUP BY Sexo;


-- 2 - Total de Produtos por marca
SELECT 
	Marca_Produto,
    COUNT(*) AS 'QTD Produtos'
FROM produtos
GROUP BY Marca_Produto;


-- 3 - Qual A Receita Total e o Custo total de cada loja
SELECT 
	ID_Loja,
    SUM(Receita_Venda) AS 'Receita Total', 
    SUM(Custo_Venda) AS 'Custo Total'
FROM pedidos
GROUP BY ID_Loja;

###6 - INSERT

In [ ]:
INSERT INTO discentes (nome, curso)
VALUES ("Sebastião", "Economia");

###6 - UPDATE

In [ ]:
UPDATE discentes
SET curso = 'UX/UI'
WHERE id = '1';

###7 - Delete

In [ ]:

DELETE FROM discentes
WHERE nome = 'Antônio'